In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
import os
os.getcwd()

'/mnt/c/Users/Juana Mari/Desktop/Ironhack/Proyectos/ataque_tiburones'

In [3]:
tiburon = pd.read_csv("data/attacks.csv", encoding = "ISO-8859-1")
tiburon.sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
20494,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4738,1941.08.21.R,Reported 21-Aug-1941,1941.0,Provoked,USA,New York,Montauk,Fishing,Captain Jack Kelly,NaN,...,NaN,"New York Times, 8/21/1941",1941.08.21.R-Kelly.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1941.08.21.R,1941.08.21.R,1565.0,NaN,NaN
25146,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18404,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6637,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
# Verificamos que sea un dataframe
type(tiburon)

pandas.core.frame.DataFrame

In [5]:
# Ver que tipo de datos hay
tiburon.dtypes

Case Number                object
Date                       object
Year                      float64
Type                       object
Country                    object
Area                       object
Location                   object
Activity                   object
Name                       object
Sex                        object
Age                        object
Injury                     object
Fatal (Y/N)                object
Time                       object
Species                    object
Investigator or Source     object
pdf                        object
href formula               object
href                       object
Case Number.1              object
Case Number.2              object
original order            float64
Unnamed: 22                object
Unnamed: 23                object
dtype: object

In [6]:
tiburon.describe()
# Obtener datos estadÃ­sticos rÃ¡pidos de lo que hay dentro.

              Year  original order
count  6300.000000     6309.000000
mean   1927.272381     3155.999683
std     281.116308     1821.396206
min       0.000000        2.000000
25%    1942.000000     1579.000000
50%    1977.000000     3156.000000
75%    2005.000000     4733.000000
max    2018.000000     6310.000000

In [7]:
# Â¿CuÃ¡ntos nulos existen en cada columna?
tiburon.isnull().sum(axis = 0)

Case Number               17021
Date                      19421
Year                      19423
Type                      19425
Country                   19471
Area                      19876
Location                  19961
Activity                  19965
Name                      19631
Sex                       19986
Age                       22252
Injury                    19449
Fatal (Y/N)               19960
Time                      22775
Species                   22259
Investigator or Source    19438
pdf                       19421
href formula              19422
href                      19421
Case Number.1             19421
Case Number.2             19421
original order            19414
Unnamed: 22               25722
Unnamed: 23               25721
dtype: int64

In [8]:
'''
DespuÃ©s de revisar todos los datos de cada columna del dataframe, hay algunas columnas que podemos eliminar
ya que no nos van a dar informaciÃ³n relevante en el estudio de los ataques de tiburones. Estas son; 
"Name", "Investigator or Source", "pdf", "href formula", "href", "Case Number.1", "Case Number.2", 
"original order", "Unnamed: 22", "Unnamed: 23".
'''

'\nDespuÃ©s de revisar todos los datos de cada columna del dataframe, hay algunas columnas que podemos eliminar\nya que no nos van a dar informaciÃ³n relevante en el estudio de los ataques de tiburones. Estas son; \n"Name", "Investigator or Source", "pdf", "href formula", "href", "Case Number.1", "Case Number.2", \n"original order", "Unnamed: 22", "Unnamed: 23".\n'

In [9]:
# Se eliminan las columnas; 
tiburon2 = tiburon.drop(["Name", "Investigator or Source", "pdf", "href formula", "href", "Case Number.1", "Case Number.2", 
"original order", "Unnamed: 22", "Unnamed: 23"], axis=1)
tiburon2.sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
6995,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6844,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14471,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5857,1877.03.16,16-Mar-1877,1877.0,Unprovoked,ITALY,Strait of Messina,Off Calabria,Paddling,M,NaN,3 ribs broken by shark's tail,N,NaN,NaN
25664,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
# Revisamos aquellas filas que tengan todos los valores NaN (no proporcionan informaciÃ³n) y se eliminan:
(tiburon2[tiburon2.duplicated()]).sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
21404,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16811,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17572,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19653,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23416,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
# El recuento de todas las filas duplicadas es:
tiburon2.duplicated().sum()

19418

In [12]:
# Eliminamos todas las filas que tengan NaN en todas las columnas
tiburon3 = tiburon2.dropna(how='all')
tiburon3.sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
2464,1993.11.12,12-Nov-1993,1993.0,Unprovoked,USA,Hawaii,"Horners, Wailua, Kaua'i","Surfing, paddling shorewards",M,NaN,Left leg severely bitten,N,10h55,NaN
4879,1936.06.06,06-Jun-1936,1936.0,Unprovoked,USA,Florida,"Boca Ciega Bay, Pinellas County",Swimming,M,NaN,FATAL,Y,NaN,NaN
6854,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2175,1998.08.01.a,01-Aug-1998,1998.0,Unprovoked,SOUTH AFRICA,Western Cape Province,Pringle Bay,Spearfishing,M,24,Leg bitten,N,13h00,"White shark, 4.9 m [16']"
3747,1963.07.00,Jul-1963,1963.0,Unprovoked,PANAMA,San Blas coast,"4 miles from Tuwala, near Mulatuppu","Seining for bait, standing in chest-deep water",M,NaN,"FATAL, foot nearly severed",Y,NaN,NaN

In [13]:
'''
DespuÃ©s de eliminar todas las filas que tienen todo NaN, reviso aquellas filas que puedan estar duplicadas.
La informaciÃ³n obtenida es que todo son NaN excepto el Case Number que es = 0, por tanto, tampoco es informaciÃ³n Ãºtil para el 
estudio y se pueden eliminar.
'''
(tiburon3[tiburon3.duplicated()]).sample(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
7426,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8231,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7483,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7160,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8385,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
tiburon4 = tiburon3.drop_duplicates()
tiburon4.tail(5)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
6299,ND.0003,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,M,NaN,FATAL,Y,NaN,NaN
6300,ND.0002,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ÂºN, 79ÂºW",NaN,M,NaN,FATAL,Y,NaN,NaN
6301,ND.0001,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN
6302,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25722,xx,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
# Se eliminan las filas en las que todo es NaN y el 'Case Number' es igual a 0 y a xx (son las dos Ãºltimas filas)
tiburon5 = tiburon4.drop([6302, 25722], axis = 0)
tiburon5.tail(3)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Injury,Fatal (Y/N),Time,Species
6299,ND.0003,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,M,NaN,FATAL,Y,NaN,NaN
6300,ND.0002,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ÂºN, 79ÂºW",NaN,M,NaN,FATAL,Y,NaN,NaN
6301,ND.0001,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN

In [16]:
# Ya no hay filas con elementos duplicados.
(tiburon5[tiburon5.duplicated()])

Empty DataFrame
Columns: [Case Number, Date, Year, Type, Country, Area, Location, Activity, Sex , Age, Injury, Fatal (Y/N), Time, Species ]
Index: []

In [17]:
# Paso a minÃºscula todos los nombres de las columnas y cambio el nombre de dos de ellas para eliminar carÃ¡cteres especiales.
tiburon5.columns = map(str.lower, tiburon5.columns)
tiburon5.head(2)

,case number,date,year,type,country,area,location,activity,sex,age,injury,fatal (y/n),time,species
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,F,57,"No injury to occupant, outrigger canoe and pad...",N,18h00,White shark
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,F,11,Minor injury to left thigh,N,14h00 -15h00,NaN

In [18]:
tiburon6 = tiburon5.rename(columns = {'case number':'case',
                                     'fatal (y/n)':'fatal',
                                     'sex ':'sex',
                                     'species ': 'species'})
tiburon6.columns.tolist()

['case',
 'date',
 'year',
 'type',
 'country',
 'area',
 'location',
 'activity',
 'sex',
 'age',
 'injury',
 'fatal',
 'time',
 'species']

In [19]:
# Antes de plantear las hipÃ³tesis, he decidido mirar dentro de cada columna sus valores Ãºnicos para ver que hay en cada una.

In [20]:
tiburon6['fatal'].unique().tolist()

['N', 'Y', nan, 'M', 'UNKNOWN', '2017', ' N', 'N ', 'y']

In [21]:
'''
HIPÃ“TESIS
- El sexo masculino ha sufrido mÃ¡s ataques de tiburÃ³n
- El tiburÃ³n blanco es el mÃ¡s peligroso
- Hay mÃ¡s ataques de tiburÃ³n provocados
'''

'\nHIPÃ“TESIS\n- El sexo masculino ha sufrido mÃ¡s ataques de tiburÃ³n\n- El tiburÃ³n blanco es el mÃ¡s peligroso\n- Hay mÃ¡s ataques de tiburÃ³n provocados\n'

In [22]:
'''
DespuÃ©s de revisar todos los datos de cada columna y plantear las hipÃ³tesis, hay ciertas columnas que no son relevantes
para llegar a las conclusiones, por lo que se van a eliminar. Son las siguientes:
'case', 'date', 'area', 'location', 'injury', 'time'
Las variables 'year' y 'country', en principio no son necesarias para el estudio de las hipÃ³tesis pero se mantendrÃ¡n por que
podrÃ­an proporcionar informaciÃ³n relevante en cuanto a localizaciÃ³n o tiempo de los ataques.
'''

"\nDespuÃ©s de revisar todos los datos de cada columna y plantear las hipÃ³tesis, hay ciertas columnas que no son relevantes\npara llegar a las conclusiones, por lo que se van a eliminar. Son las siguientes:\n'case', 'date', 'area', 'location', 'injury', 'time'\nLas variables 'year' y 'country', en principio no son necesarias para el estudio de las hipÃ³tesis pero se mantendrÃ¡n por que\npodrÃ­an proporcionar informaciÃ³n relevante en cuanto a localizaciÃ³n o tiempo de los ataques.\n"

In [23]:
tiburon7 = tiburon6.drop(['case', 'date', 'area', 'location', 'age', 'injury', 'time'], axis=1)
tiburon7

,year,type,country,activity,sex,fatal,species
0,2018.0,Boating,USA,Paddling,F,N,White shark
1,2018.0,Unprovoked,USA,Standing,F,N,NaN
2,2018.0,Invalid,USA,Surfing,M,N,NaN
3,2018.0,Unprovoked,AUSTRALIA,Surfing,M,N,2 m shark
4,2018.0,Provoked,MEXICO,Free diving,M,N,"Tiger shark, 3m"
...,...,...,...,...,...,...,...
6297,0.0,Unprovoked,AUSTRALIA,Diving,M,Y,NaN
6298,0.0,Unprovoked,AUSTRALIA,Pearl diving,M,Y,NaN
6299,0.0,Unprovoked,USA,Swimming,M,Y,NaN
6300,0.0,Unprovoked,PANAMA,NaN,M,Y,NaN
6301,0.0,Unprovoked,CEYLON (SRI LANKA),Swimming,M,Y,NaN

In [24]:
# AÃºn hay NaNs en algunas columnas. Voy a ver cuantos y a reemplazarlos por 'Unknown'
tiburon7.isnull().sum()

year           2
type           4
country       50
activity     544
sex          565
fatal        539
species     2838
dtype: int64

In [25]:
# Sustituyo todos los NaN por "Unknown"
tiburon7.fillna('Unknown', inplace= True)
tiburon7.sample(5)

,year,type,country,activity,sex,fatal,species
4364,1953.0,Unprovoked,USA,Scuba diving,M,N,Unknown
4683,1943.0,Sea Disaster,PACIFIC OCEAN,The USS Wahoo torpedoes & sank the Japanese tr...,M,Y,Unknown
5376,1912.0,Unprovoked,FIJI,Washed overboard,M,Y,Unknown
5633,1895.0,Unprovoked,USA,Swimming,M,Y,Unknown
1516,2005.0,Unprovoked,USA,Swimming,M,N,Tiger shark

In [26]:
tiburon7.isna().sum()

year        0
type        0
country     0
activity    0
sex         0
fatal       0
species     0
dtype: int64

## Variable 'year'

In [27]:
#Ojo!!  Donde haya 1s son Unknown!! 
tiburon7['year'] = tiburon7['year'].replace(['Unknown'], '1')

In [28]:
tiburon7['year'] = tiburon7['year'].astype(int)

In [29]:
# tiburon7['year'].unique().tolist()

In [30]:
tiburon7['year'] = tiburon7['year'].replace([1], 'Unknown')

## Variable 'type'

In [31]:
tiburon7['type'] = tiburon7['type'].replace(['Boating', 'Boatomg'], 'Boat')

In [32]:
tiburon7['type'].unique().tolist()

['Boat',
 'Unprovoked',
 'Invalid',
 'Provoked',
 'Questionable',
 'Sea Disaster',
 'Unknown']

# Variable 'Country'  Â¡Â¡Â¡Â¡Â¡ Volver a revisar si tienes tiempo --- OJO!!!

In [33]:
# tiburon7['country'].unique().tolist()

In [34]:
tiburon7['country'] = tiburon7['country'].str.lower().str.strip()

In [35]:
#tiburon7['country'] = tiburon7['country'].str.strip()

## Variable 'Activity'

## Variable 'Sex'

In [36]:
tiburon7['sex'].unique().tolist()

['F', 'M', 'Unknown', 'M ', 'lli', 'N', '.']

In [37]:
# Se eliminan espacios en blanco
tiburon7['sex'] = tiburon7['sex'].str.strip()

In [38]:
# Se crea una funciÃ³n para que todos aquellos carÃ¡cteres que no sean ni 'M' ni 'F' se sustituyan por 'unknown'
def funcion_sex (a):
    if a not in ('F', 'M'):
        return 'Unknown'
    else:
        return a

In [39]:
# Se aplica la funciÃ³n a toda la columna
tiburon7.sex = tiburon7.sex.apply(funcion_sex)

In [40]:
# Comprobamos que todo estÃ© ok
tiburon7['sex'].unique().tolist()

['F', 'M', 'Unknown']

## Variable 'fatal'

In [57]:
tiburon7.fatal = tiburon7.fatal.str.replace(' ', '').str.upper()

In [58]:
tiburon7['fatal'].unique().tolist()

['N', 'Y', 'UNKNOWN', 'M', '2017']

In [66]:
tiburon7['fatal'] = tiburon7['fatal'].replace(['2017','M'], 'UNKNOWN')

In [67]:
tiburon7['fatal'] = tiburon7['fatal'].replace(['UNKNOWN'], 'Unknown')

In [68]:
tiburon7['fatal'].unique().tolist()

['N', 'Y', 'Unknown']

## Variable 'species'

In [101]:
# tiburon7['species'].unique().tolist()

In [97]:
# Elimino todos los nÃºmeros que hay en la lista y se pasa todo a minÃºsculas
tiburon7.species = tiburon7.species.str.replace('[\d]+.', '').str.lower()

<ipython-input-97-803dcc26a9ac>:2: FutureWarning: The default value of regex will change from True to False in a future version.
  tiburon7.species = tiburon7.species.str.replace('[\d]+.', '').str.lower()

In [100]:
# tiburon7['species'].unique().tolist()

In [69]:
#def function_species(palabra):
    if 'white' in palabra:
        return "white shark"
    else:
        return palabra

In [70]:
#tiburon7.species = tiburon7.species.apply(function_species)

In [99]:
# tiburon7['species'].value_counts()

In [103]:
tiburon7['species'].value_counts().head(40)

unknown                                               2839
white shark                                            667
 shark                                                 234
m [] shark                                             211
shark involvement prior to death was not confirmed     105
invalid                                                102
m shark                                                100
 to  shark                                             100
shark involvement not confirmed                         89
tiger shark                                             73
shark involvement prior to death unconfirmed            68
bull shark                                              55
m to m [ to ] shark                                     42
questionable incident                                   38
questionable                                            34
bull shark,                                             22
no shark involvement                                    21
wobbegong shark                                         21
tiger shark,                                            21
tiger shark, m []                                       20
tiger shark, m []                                       17
tiger shark, m to m [ to ]                              16
"a small shark"                                         16
blacktip shark                                          15
blue shark                                              14
tiger shark,                                            14
bronze whaler shark, m []                               13
mako shark                                              13
shark involvement prior to death not confirmed          13
nurse shark                                             13
bronze whaler shark                                     12
raggedtooth shark                                       12
zambesi shark                                           11
grey nurse shark                                        11
a small shark                                           11
lb shark                                                10
raggedtooth shark, m []                                 10
m [] bull shark                                         10
m []  shark                                              9
nurse shark, m []                                        9
Name: species, dtype: int64

In [104]:
import re
L = ['white shark', 'tiger shark', 'bull shark', 'mako shark', 
     'lemon shark', 'whitetip shark', 'blue shark', 'galapagos shark', 'caribbean shark', 'dusty shark', 
     'black shark', 'silky shark', 'reef shark', 'hammerhead shark', 'nurse shark', 'blacktip shark', 
     'wobbegong shark', 'raggedtooth shark']

pat = '|'.join(r"\b{}\b".format(x) for x in L)

tiburon7['especies'] = tiburon7['species'].str.extract('('+ pat + ')', expand=False, flags=re.I)

,year,type,country,activity,sex,fatal,species,especies
0,2018,Boat,usa,Paddling,F,N,white shark,white shark
1,2018,Unprovoked,usa,Standing,F,N,unknown,NaN
2,2018,Invalid,usa,Surfing,M,N,unknown,NaN
3,2018,Unprovoked,australia,Surfing,M,N,m shark,NaN
4,2018,Provoked,mexico,Free diving,M,N,"tiger shark,",tiger shark
...,...,...,...,...,...,...,...,...
6297,0,Unprovoked,australia,Diving,M,Y,unknown,NaN
6298,0,Unprovoked,australia,Pearl diving,M,Y,unknown,NaN
6299,0,Unprovoked,usa,Swimming,M,Y,unknown,NaN
6300,0,Unprovoked,panama,Unknown,M,Y,unknown,NaN
6301,0,Unprovoked,ceylon (sri lanka),Swimming,M,Y,unknown,NaN

In [105]:
tiburon7['especies'].unique().tolist()

['white shark',
 nan,
 'tiger shark',
 'lemon shark',
 'bull shark',
 'reef shark',
 'nurse shark',
 'wobbegong shark',
 'blacktip shark',
 'galapagos shark',
 'blue shark',
 'mako shark',
 'silky shark',
 'hammerhead shark',
 'raggedtooth shark']

In [106]:
tiburon7['especies'].value_counts().sum()

1586

In [107]:
tiburon7.especies.isna().sum()

4716

 ## Estas funcionan por separado:

In [54]:
# df.sport = df.sport.apply(lambda x: 'ball sport' if 'ball' in x else x)
# tiburon7.species = tiburon7.species.apply(lambda x:'white shark' if 'white' in x else x)

In [55]:
# tiburon7.species = tiburon7.species.apply(lambda x:'tiger shark' if 'tiger' in x else x)

In [56]:
# tiburon7['species'].unique().tolist()